hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_qeiv2_regs.h
/*
 * HOMEIE (RW)
 *
 * 1- generate interrupt when homef flag set
 */
#define QEIV2_IRQEN_HOMEIE_MASK (0x40000000UL)
#define QEIV2_IRQEN_HOMEIE_SHIFT (30U)
#define QEIV2_IRQEN_HOMEIE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_HOMEIE_SHIFT) & QEIV2_IRQEN_HOMEIE_MASK)
#define QEIV2_IRQEN_HOMEIE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_HOMEIE_MASK) >> QEIV2_IRQEN_HOMEIE_SHIFT)

/*
 * POSCMPIE (RW)
 *
 * 1- generate interrupt when poscmpf flag set
 */
#define QEIV2_IRQEN_POSCMPIE_MASK (0x20000000UL)
#define QEIV2_IRQEN_POSCMPIE_SHIFT (29U)
#define QEIV2_IRQEN_POSCMPIE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_POSCMPIE_SHIFT) & QEIV2_IRQEN_POSCMPIE_MASK)
#define QEIV2_IRQEN_POSCMPIE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_POSCMPIE_MASK) >> QEIV2_IRQEN_POSCMPIE_SHIFT)

/*
 * ZPHIE (RW)
 *
 * 1- generate interrupt when zphf flag set
 */
#define QEIV2_IRQEN_ZPHIE_MASK (0x10000000UL)
#define QEIV2_IRQEN_ZPHIE_SHIFT (28U)
#define QEIV2_IRQEN_ZPHIE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_ZPHIE_SHIFT) & QEIV2_IRQEN_ZPHIE_MASK)
#define QEIV2_IRQEN_ZPHIE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_ZPHIE_MASK) >> QEIV2_IRQEN_ZPHIE_SHIFT)

/*
 * ZMISSE (RW)
 *
 */
#define QEIV2_IRQEN_ZMISSE_MASK (0x8000000UL)
#define QEIV2_IRQEN_ZMISSE_SHIFT (27U)
#define QEIV2_IRQEN_ZMISSE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_ZMISSE_SHIFT) & QEIV2_IRQEN_ZMISSE_MASK)
#define QEIV2_IRQEN_ZMISSE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_ZMISSE_MASK) >> QEIV2_IRQEN_ZMISSE_SHIFT)

/*
 * WIDTHTME (RW)
 *
 */
#define QEIV2_IRQEN_WIDTHTME_MASK (0x4000000UL)
#define QEIV2_IRQEN_WIDTHTME_SHIFT (26U)
#define QEIV2_IRQEN_WIDTHTME_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_WIDTHTME_SHIFT) & QEIV2_IRQEN_WIDTHTME_MASK)
#define QEIV2_IRQEN_WIDTHTME_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_WIDTHTME_MASK) >> QEIV2_IRQEN_WIDTHTME_SHIFT)

/*
 * POS2CMPE (RW)
 *
 */
#define QEIV2_IRQEN_POS2CMPE_MASK (0x2000000UL)
#define QEIV2_IRQEN_POS2CMPE_SHIFT (25U)
#define QEIV2_IRQEN_POS2CMPE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_POS2CMPE_SHIFT) & QEIV2_IRQEN_POS2CMPE_MASK)
#define QEIV2_IRQEN_POS2CMPE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_POS2CMPE_MASK) >> QEIV2_IRQEN_POS2CMPE_SHIFT)

/*
 * DIRCHGE (RW)
 *
 */
#define QEIV2_IRQEN_DIRCHGE_MASK (0x1000000UL)
#define QEIV2_IRQEN_DIRCHGE_SHIFT (24U)
#define QEIV2_IRQEN_DIRCHGE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_DIRCHGE_SHIFT) & QEIV2_IRQEN_DIRCHGE_MASK)
#define QEIV2_IRQEN_DIRCHGE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_DIRCHGE_MASK) >> QEIV2_IRQEN_DIRCHGE_SHIFT)

/*
 * CYCLE0E (RW)
 *
 */
#define QEIV2_IRQEN_CYCLE0E_MASK (0x800000UL)
#define QEIV2_IRQEN_CYCLE0E_SHIFT (23U)
#define QEIV2_IRQEN_CYCLE0E_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_CYCLE0E_SHIFT) & QEIV2_IRQEN_CYCLE0E_MASK)
#define QEIV2_IRQEN_CYCLE0E_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_CYCLE0E_MASK) >> QEIV2_IRQEN_CYCLE0E_SHIFT)

/*
 * CYCLE1E (RW)
 *
 */
#define QEIV2_IRQEN_CYCLE1E_MASK (0x400000UL)
#define QEIV2_IRQEN_CYCLE1E_SHIFT (22U)
#define QEIV2_IRQEN_CYCLE1E_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_CYCLE1E_SHIFT) & QEIV2_IRQEN_CYCLE1E_MASK)
#define QEIV2_IRQEN_CYCLE1E_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_CYCLE1E_MASK) >> QEIV2_IRQEN_CYCLE1E_SHIFT)

/*
 * PULSE0E (RW)
 *
 */
#define QEIV2_IRQEN_PULSE0E_MASK (0x200000UL)
#define QEIV2_IRQEN_PULSE0E_SHIFT (21U)
#define QEIV2_IRQEN_PULSE0E_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_PULSE0E_SHIFT) & QEIV2_IRQEN_PULSE0E_MASK)
#define QEIV2_IRQEN_PULSE0E_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_PULSE0E_MASK) >> QEIV2_IRQEN_PULSE0E_SHIFT)

/*
 * PULSE1E (RW)
 *
 */
#define QEIV2_IRQEN_PULSE1E_MASK (0x100000UL)
#define QEIV2_IRQEN_PULSE1E_SHIFT (20U)
#define QEIV2_IRQEN_PULSE1E_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_PULSE1E_SHIFT) & QEIV2_IRQEN_PULSE1E_MASK)
#define QEIV2_IRQEN_PULSE1E_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_PULSE1E_MASK) >> QEIV2_IRQEN_PULSE1E_SHIFT)

/*
 * HOME2E (RW)
 *
 */
#define QEIV2_IRQEN_HOME2E_MASK (0x80000UL)
#define QEIV2_IRQEN_HOME2E_SHIFT (19U)
#define QEIV2_IRQEN_HOME2E_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_HOME2E_SHIFT) & QEIV2_IRQEN_HOME2E_MASK)
#define QEIV2_IRQEN_HOME2E_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_HOME2E_MASK) >> QEIV2_IRQEN_HOME2E_SHIFT)

/*
 * FAULTE (RW)
 *
 */
#define QEIV2_IRQEN_FAULTE_MASK (0x40000UL)
#define QEIV2_IRQEN_FAULTE_SHIFT (18U)
#define QEIV2_IRQEN_FAULTE_SET(x) (((uint32_t)(x) << QEIV2_IRQEN_FAULTE_SHIFT) & QEIV2_IRQEN_FAULTE_MASK)
#define QEIV2_IRQEN_FAULTE_GET(x) (((uint32_t)(x) & QEIV2_IRQEN_FAULTE_MASK) >> QEIV2_IRQEN_FAULTE_SHIFT)

/* Bitfield definition for register of struct array COUNT: Z */
/*
 * ZCNT (RW)
 *
 * zcnt value
 */
#define QEIV2_COUNT_Z_ZCNT_MASK (0xFFFFFFFFUL)
#define QEIV2_COUNT_Z_ZCNT_SHIFT (0U)
#define QEIV2_COUNT_Z_ZCNT_SET(x) (((uint32_t)(x) << QEIV2_COUNT_Z_ZCNT_SHIFT) & QEIV2_COUNT_Z_ZCNT_MASK)
#define QEIV2_COUNT_Z_ZCNT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_Z_ZCNT_MASK) >> QEIV2_COUNT_Z_ZCNT_SHIFT)

/* Bitfield definition for register of struct array COUNT: PH */
/*
 * DIR (RO)
 *
 * 1- reverse rotation
 * 0- forward rotation
 */
#define QEIV2_COUNT_PH_DIR_MASK (0x40000000UL)
#define QEIV2_COUNT_PH_DIR_SHIFT (30U)
#define QEIV2_COUNT_PH_DIR_GET(x) (((uint32_t)(x) & QEIV2_COUNT_PH_DIR_MASK) >> QEIV2_COUNT_PH_DIR_SHIFT)

/*
 * ASTAT (RO)
 *
 * 1- a input is high
 * 0- a input is low
 */
#define QEIV2_COUNT_PH_ASTAT_MASK (0x4000000UL)
#define QEIV2_COUNT_PH_ASTAT_SHIFT (26U)
#define QEIV2_COUNT_PH_ASTAT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_PH_ASTAT_MASK) >> QEIV2_COUNT_PH_ASTAT_SHIFT)

/*
 * BSTAT (RO)
 *
 * 1- b input is high
 * 0- b input is low
 */
#define QEIV2_COUNT_PH_BSTAT_MASK (0x2000000UL)
#define QEIV2_COUNT_PH_BSTAT_SHIFT (25U)
#define QEIV2_COUNT_PH_BSTAT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_PH_BSTAT_MASK) >> QEIV2_COUNT_PH_BSTAT_SHIFT)

/*
 * PHCNT (RO)
 *
 * phcnt value
 */
#define QEIV2_COUNT_PH_PHCNT_MASK (0x1FFFFFUL)
#define QEIV2_COUNT_PH_PHCNT_SHIFT (0U)
#define QEIV2_COUNT_PH_PHCNT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_PH_PHCNT_MASK) >> QEIV2_COUNT_PH_PHCNT_SHIFT)

/* Bitfield definition for register of struct array COUNT: SPD */
/*
 * DIR (RO)
 *
 * 1- reverse rotation
 * 0- forward rotation
 */
#define QEIV2_COUNT_SPD_DIR_MASK (0x80000000UL)
#define QEIV2_COUNT_SPD_DIR_SHIFT (31U)
#define QEIV2_COUNT_SPD_DIR_GET(x) (((uint32_t)(x) & QEIV2_COUNT_SPD_DIR_MASK) >> QEIV2_COUNT_SPD_DIR_SHIFT)

