hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_qeiv2_regs.h
/*
 * DIRCMP2 (RW)
 *
 */
#define QEIV2_MATCH_CFG_DIRCMP2_MASK (0x2000U)
#define QEIV2_MATCH_CFG_DIRCMP2_SHIFT (13U)
#define QEIV2_MATCH_CFG_DIRCMP2_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_DIRCMP2_SHIFT) & QEIV2_MATCH_CFG_DIRCMP2_MASK)
#define QEIV2_MATCH_CFG_DIRCMP2_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_DIRCMP2_MASK) >> QEIV2_MATCH_CFG_DIRCMP2_SHIFT)

/*
 * SPDCMP2DIS (RW)
 *
 */
#define QEIV2_MATCH_CFG_SPDCMP2DIS_MASK (0x1000U)
#define QEIV2_MATCH_CFG_SPDCMP2DIS_SHIFT (12U)
#define QEIV2_MATCH_CFG_SPDCMP2DIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_SPDCMP2DIS_SHIFT) & QEIV2_MATCH_CFG_SPDCMP2DIS_MASK)
#define QEIV2_MATCH_CFG_SPDCMP2DIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_SPDCMP2DIS_MASK) >> QEIV2_MATCH_CFG_SPDCMP2DIS_SHIFT)

/*
 * PHASE_MATCH_DIS2 (RW)
 *
 */
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_MASK (0x800U)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_SHIFT (11U)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_SHIFT) & QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_MASK)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_MASK) >> QEIV2_MATCH_CFG_PHASE_MATCH_DIS2_SHIFT)

/*
 * POS_MATCH2_DIR (RW)
 *
 */
#define QEIV2_MATCH_CFG_POS_MATCH2_DIR_MASK (0x400U)
#define QEIV2_MATCH_CFG_POS_MATCH2_DIR_SHIFT (10U)
#define QEIV2_MATCH_CFG_POS_MATCH2_DIR_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_POS_MATCH2_DIR_SHIFT) & QEIV2_MATCH_CFG_POS_MATCH2_DIR_MASK)
#define QEIV2_MATCH_CFG_POS_MATCH2_DIR_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_POS_MATCH2_DIR_MASK) >> QEIV2_MATCH_CFG_POS_MATCH2_DIR_SHIFT)

/*
 * POS_MATCH2_OPT (RW)
 *
 */
#define QEIV2_MATCH_CFG_POS_MATCH2_OPT_MASK (0x200U)
#define QEIV2_MATCH_CFG_POS_MATCH2_OPT_SHIFT (9U)
#define QEIV2_MATCH_CFG_POS_MATCH2_OPT_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_POS_MATCH2_OPT_SHIFT) & QEIV2_MATCH_CFG_POS_MATCH2_OPT_MASK)
#define QEIV2_MATCH_CFG_POS_MATCH2_OPT_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_POS_MATCH2_OPT_MASK) >> QEIV2_MATCH_CFG_POS_MATCH2_OPT_SHIFT)

/* Bitfield definition for register array: FILT_CFG */
/*
 * OUTINV (RW)
 *
 * 1- Filter will invert the output
 * 0- Filter will not invert the output
 */
#define QEIV2_FILT_CFG_OUTINV_MASK (0x10000UL)
#define QEIV2_FILT_CFG_OUTINV_SHIFT (16U)
#define QEIV2_FILT_CFG_OUTINV_SET(x) (((uint32_t)(x) << QEIV2_FILT_CFG_OUTINV_SHIFT) & QEIV2_FILT_CFG_OUTINV_MASK)
#define QEIV2_FILT_CFG_OUTINV_GET(x) (((uint32_t)(x) & QEIV2_FILT_CFG_OUTINV_MASK) >> QEIV2_FILT_CFG_OUTINV_SHIFT)

/*
 * MODE (RW)
 *
 * This bitfields defines the filter mode
 * 000-bypass;
 * 100-rapid change mode;
 * 101-delay filter mode;
 * 110-stable low mode;
 * 111-stable high mode
 */
#define QEIV2_FILT_CFG_MODE_MASK (0xE000U)
#define QEIV2_FILT_CFG_MODE_SHIFT (13U)
#define QEIV2_FILT_CFG_MODE_SET(x) (((uint32_t)(x) << QEIV2_FILT_CFG_MODE_SHIFT) & QEIV2_FILT_CFG_MODE_MASK)
#define QEIV2_FILT_CFG_MODE_GET(x) (((uint32_t)(x) & QEIV2_FILT_CFG_MODE_MASK) >> QEIV2_FILT_CFG_MODE_SHIFT)

/*
 * SYNCEN (RW)
 *
 * set to enable sychronization input signal with TRGM clock
 */
#define QEIV2_FILT_CFG_SYNCEN_MASK (0x1000U)
#define QEIV2_FILT_CFG_SYNCEN_SHIFT (12U)
#define QEIV2_FILT_CFG_SYNCEN_SET(x) (((uint32_t)(x) << QEIV2_FILT_CFG_SYNCEN_SHIFT) & QEIV2_FILT_CFG_SYNCEN_MASK)
#define QEIV2_FILT_CFG_SYNCEN_GET(x) (((uint32_t)(x) & QEIV2_FILT_CFG_SYNCEN_MASK) >> QEIV2_FILT_CFG_SYNCEN_SHIFT)

/*
 * FILTLEN (RW)
 *
 * This bitfields defines the filter counter length.
 */
#define QEIV2_FILT_CFG_FILTLEN_MASK (0xFFFU)
#define QEIV2_FILT_CFG_FILTLEN_SHIFT (0U)
#define QEIV2_FILT_CFG_FILTLEN_SET(x) (((uint32_t)(x) << QEIV2_FILT_CFG_FILTLEN_SHIFT) & QEIV2_FILT_CFG_FILTLEN_MASK)
#define QEIV2_FILT_CFG_FILTLEN_GET(x) (((uint32_t)(x) & QEIV2_FILT_CFG_FILTLEN_MASK) >> QEIV2_FILT_CFG_FILTLEN_SHIFT)

/* Bitfield definition for register: QEI_CFG */
/*
 * SW_PULSE0_RESTART (RW)
 *
 * set to restart cycle counter for configed pulse_num. HW auto clear
 */
#define QEIV2_QEI_CFG_SW_PULSE0_RESTART_MASK (0x80000000UL)
#define QEIV2_QEI_CFG_SW_PULSE0_RESTART_SHIFT (31U)
#define QEIV2_QEI_CFG_SW_PULSE0_RESTART_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SW_PULSE0_RESTART_SHIFT) & QEIV2_QEI_CFG_SW_PULSE0_RESTART_MASK)
#define QEIV2_QEI_CFG_SW_PULSE0_RESTART_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SW_PULSE0_RESTART_MASK) >> QEIV2_QEI_CFG_SW_PULSE0_RESTART_SHIFT)

/*
 * SW_PULSE1_RESTART (RW)
 *
 */
#define QEIV2_QEI_CFG_SW_PULSE1_RESTART_MASK (0x40000000UL)
#define QEIV2_QEI_CFG_SW_PULSE1_RESTART_SHIFT (30U)
#define QEIV2_QEI_CFG_SW_PULSE1_RESTART_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SW_PULSE1_RESTART_SHIFT) & QEIV2_QEI_CFG_SW_PULSE1_RESTART_MASK)
#define QEIV2_QEI_CFG_SW_PULSE1_RESTART_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SW_PULSE1_RESTART_MASK) >> QEIV2_QEI_CFG_SW_PULSE1_RESTART_SHIFT)

/*
 * SW_CYCLE0_RESTART (RW)
 *
 * set to restart pulse counter for configed cycle_num. HW auto clear
 */
#define QEIV2_QEI_CFG_SW_CYCLE0_RESTART_MASK (0x20000000UL)
#define QEIV2_QEI_CFG_SW_CYCLE0_RESTART_SHIFT (29U)
#define QEIV2_QEI_CFG_SW_CYCLE0_RESTART_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SW_CYCLE0_RESTART_SHIFT) & QEIV2_QEI_CFG_SW_CYCLE0_RESTART_MASK)
#define QEIV2_QEI_CFG_SW_CYCLE0_RESTART_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SW_CYCLE0_RESTART_MASK) >> QEIV2_QEI_CFG_SW_CYCLE0_RESTART_SHIFT)

/*
 * SW_CYCLE1_RESTART (RW)
 *
 */
#define QEIV2_QEI_CFG_SW_CYCLE1_RESTART_MASK (0x10000000UL)
#define QEIV2_QEI_CFG_SW_CYCLE1_RESTART_SHIFT (28U)
#define QEIV2_QEI_CFG_SW_CYCLE1_RESTART_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SW_CYCLE1_RESTART_SHIFT) & QEIV2_QEI_CFG_SW_CYCLE1_RESTART_MASK)
#define QEIV2_QEI_CFG_SW_CYCLE1_RESTART_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SW_CYCLE1_RESTART_MASK) >> QEIV2_QEI_CFG_SW_CYCLE1_RESTART_SHIFT)

/*
 * PULSE0_ONESHOT (RW)
 *
 * set to use oneshot mode for configed pulse_num
 */
#define QEIV2_QEI_CFG_PULSE0_ONESHOT_MASK (0x80000UL)
#define QEIV2_QEI_CFG_PULSE0_ONESHOT_SHIFT (19U)
#define QEIV2_QEI_CFG_PULSE0_ONESHOT_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_PULSE0_ONESHOT_SHIFT) & QEIV2_QEI_CFG_PULSE0_ONESHOT_MASK)
#define QEIV2_QEI_CFG_PULSE0_ONESHOT_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_PULSE0_ONESHOT_MASK) >> QEIV2_QEI_CFG_PULSE0_ONESHOT_SHIFT)

