hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_qeiv2_regs.h
/*
 * Y_PARAM0 (RW)
 *
 */
#define QEIV2_ADCY_CFG1_Y_PARAM0_MASK (0xFFFFU)
#define QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT (0U)
#define QEIV2_ADCY_CFG1_Y_PARAM0_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT) & QEIV2_ADCY_CFG1_Y_PARAM0_MASK)
#define QEIV2_ADCY_CFG1_Y_PARAM0_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG1_Y_PARAM0_MASK) >> QEIV2_ADCY_CFG1_Y_PARAM0_SHIFT)

/* Bitfield definition for register: ADCY_CFG2 */
/*
 * Y_OFFSET (RW)
 *
 */
#define QEIV2_ADCY_CFG2_Y_OFFSET_MASK (0xFFFFFFFFUL)
#define QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT (0U)
#define QEIV2_ADCY_CFG2_Y_OFFSET_SET(x) (((uint32_t)(x) << QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT) & QEIV2_ADCY_CFG2_Y_OFFSET_MASK)
#define QEIV2_ADCY_CFG2_Y_OFFSET_GET(x) (((uint32_t)(x) & QEIV2_ADCY_CFG2_Y_OFFSET_MASK) >> QEIV2_ADCY_CFG2_Y_OFFSET_SHIFT)

/* Bitfield definition for register: ADCY_VAL_SW */
/*
 * ADCY_VAL_SW (RW)
 *
 */
#define QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_MASK (0xFFFFFFFFUL)
#define QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_SHIFT (0U)
#define QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_SET(x) (((uint32_t)(x) << QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_SHIFT) & QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_MASK)
#define QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_GET(x) (((uint32_t)(x) & QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_MASK) >> QEIV2_ADCY_VAL_SW_ADCY_VAL_SW_SHIFT)

/* Bitfield definition for register: CAL_CFG */
/*
 * XY_DELAY (RW)
 *
 * valid x/y delay, larger than this delay will be treated as invalid data.
 * Default 1.25us@200MHz;   max 80ms;
 */
#define QEIV2_CAL_CFG_XY_DELAY_MASK (0xFFFFFFUL)
#define QEIV2_CAL_CFG_XY_DELAY_SHIFT (0U)
#define QEIV2_CAL_CFG_XY_DELAY_SET(x) (((uint32_t)(x) << QEIV2_CAL_CFG_XY_DELAY_SHIFT) & QEIV2_CAL_CFG_XY_DELAY_MASK)
#define QEIV2_CAL_CFG_XY_DELAY_GET(x) (((uint32_t)(x) & QEIV2_CAL_CFG_XY_DELAY_MASK) >> QEIV2_CAL_CFG_XY_DELAY_SHIFT)

/* Bitfield definition for register: ADC_INJECT_CTRL */
/*
 * ADC_INJECT_EN (RW)
 *
 * set to use adcx_val and adcy_val from software
 */
#define QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_MASK (0x80000000UL)
#define QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_SHIFT (31U)
#define QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_SET(x) (((uint32_t)(x) << QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_SHIFT) & QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_MASK)
#define QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_GET(x) (((uint32_t)(x) & QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_MASK) >> QEIV2_ADC_INJECT_CTRL_ADC_INJECT_EN_SHIFT)

/*
 * ADCY_INJ_VALID (WO)
 *
 * set for adc X channel valid
 */
#define QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_MASK (0x2U)
#define QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_SHIFT (1U)
#define QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_SET(x) (((uint32_t)(x) << QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_SHIFT) & QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_MASK)
#define QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_GET(x) (((uint32_t)(x) & QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_MASK) >> QEIV2_ADC_INJECT_CTRL_ADCY_INJ_VALID_SHIFT)

/*
 * ADCX_INJ_VALID (WO)
 *
 * set for adc Y channel valid
 */
#define QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_MASK (0x1U)
#define QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_SHIFT (0U)
#define QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_SET(x) (((uint32_t)(x) << QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_SHIFT) & QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_MASK)
#define QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_GET(x) (((uint32_t)(x) & QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_MASK) >> QEIV2_ADC_INJECT_CTRL_ADCX_INJ_VALID_SHIFT)

/* Bitfield definition for register: PHASE_PARAM */
/*
 * PHASE_PARAM (RW)
 *
 */
#define QEIV2_PHASE_PARAM_PHASE_PARAM_MASK (0xFFFFFFFFUL)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT (0U)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_SET(x) (((uint32_t)(x) << QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT) & QEIV2_PHASE_PARAM_PHASE_PARAM_MASK)
#define QEIV2_PHASE_PARAM_PHASE_PARAM_GET(x) (((uint32_t)(x) & QEIV2_PHASE_PARAM_PHASE_PARAM_MASK) >> QEIV2_PHASE_PARAM_PHASE_PARAM_SHIFT)

/* Bitfield definition for register: POS_ADJ */
/*
 * POS_ADJ (RW)
 *
 */
#define QEIV2_POS_ADJ_POS_ADJ_MASK (0xFFFFFFFFUL)
#define QEIV2_POS_ADJ_POS_ADJ_SHIFT (0U)
#define QEIV2_POS_ADJ_POS_ADJ_SET(x) (((uint32_t)(x) << QEIV2_POS_ADJ_POS_ADJ_SHIFT) & QEIV2_POS_ADJ_POS_ADJ_MASK)
#define QEIV2_POS_ADJ_POS_ADJ_GET(x) (((uint32_t)(x) & QEIV2_POS_ADJ_POS_ADJ_MASK) >> QEIV2_POS_ADJ_POS_ADJ_SHIFT)

/* Bitfield definition for register: POS_THRESHOLD */
/*
 * POS_THRESHOLD (RW)
 *
 */
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK (0xFFFFFFFFUL)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT (0U)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_SET(x) (((uint32_t)(x) << QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT) & QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK)
#define QEIV2_POS_THRESHOLD_POS_THRESHOLD_GET(x) (((uint32_t)(x) & QEIV2_POS_THRESHOLD_POS_THRESHOLD_MASK) >> QEIV2_POS_THRESHOLD_POS_THRESHOLD_SHIFT)

/* Bitfield definition for register array: UVW_POS */
/*
 * UVW_POS0 (RW)
 *
 */
#define QEIV2_UVW_POS_UVW_POS0_MASK (0xFFFFFFFFUL)
#define QEIV2_UVW_POS_UVW_POS0_SHIFT (0U)
#define QEIV2_UVW_POS_UVW_POS0_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_UVW_POS0_SHIFT) & QEIV2_UVW_POS_UVW_POS0_MASK)
#define QEIV2_UVW_POS_UVW_POS0_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_UVW_POS0_MASK) >> QEIV2_UVW_POS_UVW_POS0_SHIFT)

/* Bitfield definition for register array: UVW_POS_CFG */
/*
 * POS_EN (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_POS_EN_MASK (0x40U)
#define QEIV2_UVW_POS_CFG_POS_EN_SHIFT (6U)
#define QEIV2_UVW_POS_CFG_POS_EN_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_POS_EN_SHIFT) & QEIV2_UVW_POS_CFG_POS_EN_MASK)
#define QEIV2_UVW_POS_CFG_POS_EN_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_POS_EN_MASK) >> QEIV2_UVW_POS_CFG_POS_EN_SHIFT)

/*
 * U_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_U_POS_SEL_MASK (0x30U)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT (4U)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_U_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_U_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_U_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_U_POS_SEL_SHIFT)

/*
 * V_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_V_POS_SEL_MASK (0xCU)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT (2U)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_V_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_V_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_V_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_V_POS_SEL_SHIFT)

