hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_qeiv2_regs.h
/*
 * W_POS_SEL (RW)
 *
 */
#define QEIV2_UVW_POS_CFG_W_POS_SEL_MASK (0x3U)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT (0U)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_SET(x) (((uint32_t)(x) << QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT) & QEIV2_UVW_POS_CFG_W_POS_SEL_MASK)
#define QEIV2_UVW_POS_CFG_W_POS_SEL_GET(x) (((uint32_t)(x) & QEIV2_UVW_POS_CFG_W_POS_SEL_MASK) >> QEIV2_UVW_POS_CFG_W_POS_SEL_SHIFT)

/* Bitfield definition for register: PHASE_CNT */
/*
 * PHASE_CNT (RW)
 *
 */
#define QEIV2_PHASE_CNT_PHASE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_PHASE_CNT_PHASE_CNT_SHIFT (0U)
#define QEIV2_PHASE_CNT_PHASE_CNT_SET(x) (((uint32_t)(x) << QEIV2_PHASE_CNT_PHASE_CNT_SHIFT) & QEIV2_PHASE_CNT_PHASE_CNT_MASK)
#define QEIV2_PHASE_CNT_PHASE_CNT_GET(x) (((uint32_t)(x) & QEIV2_PHASE_CNT_PHASE_CNT_MASK) >> QEIV2_PHASE_CNT_PHASE_CNT_SHIFT)

/* Bitfield definition for register: PHASE_UPDATE */
/*
 * INC (WO)
 *
 * set to add value to phase_cnt
 */
#define QEIV2_PHASE_UPDATE_INC_MASK (0x80000000UL)
#define QEIV2_PHASE_UPDATE_INC_SHIFT (31U)
#define QEIV2_PHASE_UPDATE_INC_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_INC_SHIFT) & QEIV2_PHASE_UPDATE_INC_MASK)
#define QEIV2_PHASE_UPDATE_INC_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_INC_MASK) >> QEIV2_PHASE_UPDATE_INC_SHIFT)

/*
 * DEC (WO)
 *
 * set to minus value from phase_cnt(set inc and dec same time willl act inc)
 */
#define QEIV2_PHASE_UPDATE_DEC_MASK (0x40000000UL)
#define QEIV2_PHASE_UPDATE_DEC_SHIFT (30U)
#define QEIV2_PHASE_UPDATE_DEC_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_DEC_SHIFT) & QEIV2_PHASE_UPDATE_DEC_MASK)
#define QEIV2_PHASE_UPDATE_DEC_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_DEC_MASK) >> QEIV2_PHASE_UPDATE_DEC_SHIFT)

/*
 * VALUE (WO)
 *
 * value to be added or minus from phase_cnt. only valid when inc or dec is set in one 32bit write operation
 */
#define QEIV2_PHASE_UPDATE_VALUE_MASK (0x3FFFFFFFUL)
#define QEIV2_PHASE_UPDATE_VALUE_SHIFT (0U)
#define QEIV2_PHASE_UPDATE_VALUE_SET(x) (((uint32_t)(x) << QEIV2_PHASE_UPDATE_VALUE_SHIFT) & QEIV2_PHASE_UPDATE_VALUE_MASK)
#define QEIV2_PHASE_UPDATE_VALUE_GET(x) (((uint32_t)(x) & QEIV2_PHASE_UPDATE_VALUE_MASK) >> QEIV2_PHASE_UPDATE_VALUE_SHIFT)

/* Bitfield definition for register: POSITION */
/*
 * POSITION (RW)
 *
 */
#define QEIV2_POSITION_POSITION_MASK (0xFFFFFFFFUL)
#define QEIV2_POSITION_POSITION_SHIFT (0U)
#define QEIV2_POSITION_POSITION_SET(x) (((uint32_t)(x) << QEIV2_POSITION_POSITION_SHIFT) & QEIV2_POSITION_POSITION_MASK)
#define QEIV2_POSITION_POSITION_GET(x) (((uint32_t)(x) & QEIV2_POSITION_POSITION_MASK) >> QEIV2_POSITION_POSITION_SHIFT)

/* Bitfield definition for register: POSITION_UPDATE */
/*
 * INC (WO)
 *
 * set to add value to position
 */
#define QEIV2_POSITION_UPDATE_INC_MASK (0x80000000UL)
#define QEIV2_POSITION_UPDATE_INC_SHIFT (31U)
#define QEIV2_POSITION_UPDATE_INC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_INC_SHIFT) & QEIV2_POSITION_UPDATE_INC_MASK)
#define QEIV2_POSITION_UPDATE_INC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_INC_MASK) >> QEIV2_POSITION_UPDATE_INC_SHIFT)

/*
 * DEC (WO)
 *
 * set to minus value from position(set inc and dec same time willl act inc)
 */
#define QEIV2_POSITION_UPDATE_DEC_MASK (0x40000000UL)
#define QEIV2_POSITION_UPDATE_DEC_SHIFT (30U)
#define QEIV2_POSITION_UPDATE_DEC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_DEC_SHIFT) & QEIV2_POSITION_UPDATE_DEC_MASK)
#define QEIV2_POSITION_UPDATE_DEC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_DEC_MASK) >> QEIV2_POSITION_UPDATE_DEC_SHIFT)

/*
 * VALUE (WO)
 *
 * value to be added or minus from position. only valid when inc or dec is set in one 32bit write operation
 */
#define QEIV2_POSITION_UPDATE_VALUE_MASK (0x3FFFFFFFUL)
#define QEIV2_POSITION_UPDATE_VALUE_SHIFT (0U)
#define QEIV2_POSITION_UPDATE_VALUE_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_VALUE_SHIFT) & QEIV2_POSITION_UPDATE_VALUE_MASK)
#define QEIV2_POSITION_UPDATE_VALUE_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_VALUE_MASK) >> QEIV2_POSITION_UPDATE_VALUE_SHIFT)

/* Bitfield definition for register: ANGLE */
/*
 * ANGLE (RO)
 *
 */
#define QEIV2_ANGLE_ANGLE_MASK (0xFFFFFFFFUL)
#define QEIV2_ANGLE_ANGLE_SHIFT (0U)
#define QEIV2_ANGLE_ANGLE_GET(x) (((uint32_t)(x) & QEIV2_ANGLE_ANGLE_MASK) >> QEIV2_ANGLE_ANGLE_SHIFT)

/* Bitfield definition for register: POS_TIMEOUT */
/*
 * ENABLE (RW)
 *
 * enable position timeout feature, if timeout, send valid again
 */
#define QEIV2_POS_TIMEOUT_ENABLE_MASK (0x80000000UL)
#define QEIV2_POS_TIMEOUT_ENABLE_SHIFT (31U)
#define QEIV2_POS_TIMEOUT_ENABLE_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_ENABLE_SHIFT) & QEIV2_POS_TIMEOUT_ENABLE_MASK)
#define QEIV2_POS_TIMEOUT_ENABLE_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_ENABLE_MASK) >> QEIV2_POS_TIMEOUT_ENABLE_SHIFT)

/*
 * TIMEOUT (RW)
 *
 * postion timeout value
 */
#define QEIV2_POS_TIMEOUT_TIMEOUT_MASK (0x7FFFFFFFUL)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT (0U)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK)
#define QEIV2_POS_TIMEOUT_TIMEOUT_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK) >> QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT)

/* Bitfield definition for register: CALC_STATE */
/*
 * STATE (RO)
 *
 * 0：calculate finish
 * other: in calculating
 */
#define QEIV2_CALC_STATE_STATE_MASK (0xF000000UL)
#define QEIV2_CALC_STATE_STATE_SHIFT (24U)
#define QEIV2_CALC_STATE_STATE_GET(x) (((uint32_t)(x) & QEIV2_CALC_STATE_STATE_MASK) >> QEIV2_CALC_STATE_STATE_SHIFT)

/* Bitfield definition for register: TOGI_CFG0 */
/*
 * SIN_TOGI (RW)
 *
 * set to use TOGI architecture for single SIN input
 */
#define QEIV2_TOGI_CFG0_SIN_TOGI_MASK (0x80000000UL)
#define QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT (31U)
#define QEIV2_TOGI_CFG0_SIN_TOGI_SET(x) (((uint32_t)(x) << QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT) & QEIV2_TOGI_CFG0_SIN_TOGI_MASK)
#define QEIV2_TOGI_CFG0_SIN_TOGI_GET(x) (((uint32_t)(x) & QEIV2_TOGI_CFG0_SIN_TOGI_MASK) >> QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT)

/* Bitfield definition for register: TOGI_CFG1 */
/*
 * W_PARAM (RW)
 *
 * w_param is angle speed, which is  2*PI*signal_hz/adc_sample_rate*2^28.
 * for example, 50Hz signal with 1MHz ADC sample rate, angle speed is 2*3.14159*50/1000000*0x10000000,
 * which is 84331(0x1496B, default value)
 * if 50Hz with 2MHz sample rate, should config to 0xA4B6
 */
#define QEIV2_TOGI_CFG1_W_PARAM_MASK (0xFFFFFFFUL)
#define QEIV2_TOGI_CFG1_W_PARAM_SHIFT (0U)
#define QEIV2_TOGI_CFG1_W_PARAM_SET(x) (((uint32_t)(x) << QEIV2_TOGI_CFG1_W_PARAM_SHIFT) & QEIV2_TOGI_CFG1_W_PARAM_MASK)
#define QEIV2_TOGI_CFG1_W_PARAM_GET(x) (((uint32_t)(x) & QEIV2_TOGI_CFG1_W_PARAM_MASK) >> QEIV2_TOGI_CFG1_W_PARAM_SHIFT)

