hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_qeiv2_regs.h
/* Bitfield definition for register: SINP_ACC */
/*
 * SINP_ACC (RO)
 *
 * positive SIN value acc in one period, updated when calculated SIN from pos to neg.
 * each SIN value is 16bit unsinged value(0x8000 for SIN30(0.5) )
 */
#define QEIV2_SINP_ACC_SINP_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_SINP_ACC_SINP_ACC_SHIFT (0U)
#define QEIV2_SINP_ACC_SINP_ACC_GET(x) (((uint32_t)(x) & QEIV2_SINP_ACC_SINP_ACC_MASK) >> QEIV2_SINP_ACC_SINP_ACC_SHIFT)

/* Bitfield definition for register: SINN_ACC */
/*
 * SINN_ACC (RO)
 *
 * negative SIN value acc in one period, updated when calculated SIN from neg to pos
 * each SIN value is 16bit unsinged value(0x8000 for SIN330(-0.5) )
 */
#define QEIV2_SINN_ACC_SINN_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_SINN_ACC_SINN_ACC_SHIFT (0U)
#define QEIV2_SINN_ACC_SINN_ACC_GET(x) (((uint32_t)(x) & QEIV2_SINN_ACC_SINN_ACC_MASK) >> QEIV2_SINN_ACC_SINN_ACC_SHIFT)

/* Bitfield definition for register: COSP_ACC */
/*
 * COSP_ACC (RO)
 *
 * positive COS value acc in one period, updated when calculated COS from pos to neg
 */
#define QEIV2_COSP_ACC_COSP_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_COSP_ACC_COSP_ACC_SHIFT (0U)
#define QEIV2_COSP_ACC_COSP_ACC_GET(x) (((uint32_t)(x) & QEIV2_COSP_ACC_COSP_ACC_MASK) >> QEIV2_COSP_ACC_COSP_ACC_SHIFT)

/* Bitfield definition for register: COSN_ACC */
/*
 * COSN_ACC (RO)
 *
 * negative COS value acc in one period, updated when calculated COS from neg to pos
 */
#define QEIV2_COSN_ACC_COSN_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_COSN_ACC_COSN_ACC_SHIFT (0U)
#define QEIV2_COSN_ACC_COSN_ACC_GET(x) (((uint32_t)(x) & QEIV2_COSN_ACC_COSN_ACC_MASK) >> QEIV2_COSN_ACC_COSN_ACC_SHIFT)



/* COUNT register group index macro definition */
#define QEIV2_COUNT_CURRENT (0UL)
#define QEIV2_COUNT_READ (1UL)
#define QEIV2_COUNT_SNAP0 (2UL)
#define QEIV2_COUNT_SNAP1 (3UL)

/* FILT_CFG register group index macro definition */
#define QEIV2_FILT_CFG_FILT_CFG_A (0UL)
#define QEIV2_FILT_CFG_FILT_CFG_B (1UL)
#define QEIV2_FILT_CFG_FILT_CFG_Z (2UL)
#define QEIV2_FILT_CFG_FILT_CFG_H (3UL)
#define QEIV2_FILT_CFG_FILT_CFG_H2 (4UL)
#define QEIV2_FILT_CFG_FILT_CFG_F (5UL)

/* UVW_POS register group index macro definition */
#define QEIV2_UVW_POS_UVW_POS0 (0UL)
#define QEIV2_UVW_POS_UVW_POS1 (1UL)
#define QEIV2_UVW_POS_UVW_POS2 (2UL)
#define QEIV2_UVW_POS_UVW_POS3 (3UL)
#define QEIV2_UVW_POS_UVW_POS4 (4UL)
#define QEIV2_UVW_POS_UVW_POS5 (5UL)

/* UVW_POS_CFG register group index macro definition */
#define QEIV2_UVW_POS_CFG_UVW_POS0_CFG (0UL)
#define QEIV2_UVW_POS_CFG_UVW_POS1_CFG (1UL)
#define QEIV2_UVW_POS_CFG_UVW_POS2_CFG (2UL)
#define QEIV2_UVW_POS_CFG_UVW_POS3_CFG (3UL)
#define QEIV2_UVW_POS_CFG_UVW_POS4_CFG (4UL)
#define QEIV2_UVW_POS_CFG_UVW_POS5_CFG (5UL)


#endif /* HPM_QEIV2_H */
